#TODO: разработать общую библеотеку классов для парсинга на уровне модификаций для разных сайтов
# функция составления Categories для файла
# функция Pagnation
# функция запуска парсера в цикле для страницы на хоум page
# функция считывания всех днных со стораницы выдачи
# функция обработки записи на странице выдачи
# функция проверки, а надо ли считывать опредленную запись
# функция считывания данных в запись и занесения данных в рабочий df
# функция считывания ттх по ссылке
# функция to_excel
# обработка unparsed

